name1 = input("pls enter your name:")    #დავალება პირველი
name2 = input("pls enter your last name:") #აქ შევქმენი ინფუთი სადაც შევიყვანე სახელი და გვარი
print(name1 +" "+ name2)   #აქ დავბეჭდე სახელიც და გვარიც

#დავალება ორი
quest1 = 100   #ცვლადი სადაც რიცხვია
quest2 = int(input("pls enter number:")) #ინპუტი სადაც მომხმარებელმა შემოიტანა რიცხვი
print(quest1 + quest2)  #ამეების შეკრება

#დავალება სამი
question1 = 10  #ცვლადი რიცხვის მნიშვნელობით 1
question2 = 40  #ცვლადი რიცხვის მნიშვნელობით 2
question3 = 90  #ცვლადი რიცხვის მნიშვნელობით 3
print(question1 + question2 + question3) #ცვლადების შეკრება
print(140 / 3)  #ცვლადების ჯამის გაყოფა რაოდენობაზე რიცხვების

#დავალება ოთხი
thing1 = str(input("pls enter number:")) #ცვლადი სადაც მომხმარებელმა უნდა ჩაწეროს სტრინგი
thing2 = int(input("pls enter number:")) #ცვლადი სადაც არის მომხმარებელმა უნდა ჩაწეროს რიცხვი
print(thing1 * 5)  #პირველი ცვლადი გავამრავლეთ 5-ზე და რადგან სტრინგია ის უბრალოდ დაიწერა 5-ჯერ
print(thing2 * 5)  #მეორე ცვლადი სადაც ისევ გავამრავლედ რიცხვზე და რადგან მთელი რიცხვია ჩვეულებრივ გამრავლდა

#დავალება მეხუთე
num1 = int(input("pls enter first number:"))  #ცვლადი სადაც მომხმარებელი შემოიტანს პირველ რიცხვს
num2 = int(input("pls enter second number:")) #ცვლადი სადაც მომხმარებელი შემოიტანს მეორე რიცხვს
print(num1 + num2)  #რიცხვების მიმატება
print(num1 - num2)  #რიცხვების გამოკლება
print(num1 * num2) #რიცხვების გამრავლება
print(num1 / num2) #რიცხვების გაყოფა
