print(250+300) #რიცხვების შეკრება პრინტ ფუნქციით
print(800-120)  #რიცხვების გამოკლება
print(10*4)   #რიცხვების გამრავლება
print(30/3)  #რიცხვების გაყოფა

#ტერმინალის მნიშვნელობა: ტერმინალი არის ფანჯარა ვიზუალ სტუდიოში რომელიც გვეხმარება კოდის წერაში,რომ კოდის დაწერისას გამოისახოს შესრულებული მოქმედება, გვაჩვენოს ჩვენი შედეგი კოდის დაწერის შემდეგ.

name1=30
name2= 40         #აქ შევქმენი ცვლადი რომელსაც მივანიჭე რიცხვი და დაბეჭვდის საშუალებით შევკრიბე ისინი
print(name1 + name2)

first_name ="saxeli"
last_name  ="gvari"
full_name  = first_name +" "+ last_name  #აქ შევქმენი ცვლადი რის დახმარებითაც ტერმინალში გამოისახა ჩემი სახელი და გვარი
print("me mqvia" + full_name)

question1 = 150
question2 = 250
print(question2 / question1)

#რა არის სტრინგი:სტრინგი არის ნებისმიერი ტექსტი თუ რიცხვი რაც არის ბრჭალებში ჩაწერილი.
#რა არის მთელი რიცხვი:მთელი რიცხვი არის ის რასაც არ უწერია პირველი რიცხვის შემდეგ წერტილი და არის მხოლოდ ისეთი რიცხვი რასაც ჩვეულებრივად წავიკითხავთ