#დავალება 1
for i in range(21): #20 ის ჩათვლით რიცხვების გამოტანა
    print(i)

#დავალება 2
num = int(input("Enter a number: ")) #მომხმარებლის შემოტანილი რიცხვი

if num % 2 == 0:
    print("Number is even") #დაიბეჭდება მხოლოდ ლუწი რიცხვის შემთხვევაში

#დავალება 3
for i in range(21):
    if i % 2 ==0:
        print(i)

#დავალება 4
sum = 0
for i in range(51, 101): #50 დან 100 ის ჩათვლით რიცხვები
    sum += i  #თითოეული რიცხვის მიმატება
print(sum) #დაბეჭდვა

#დავალება 5
for i in range(1, 51):  #1 დან 50 ის ჩათვლით რიცხვები
    if i % 5 == 0: #5 ის ჯერადი რიცხვები
        print(i) #დაბეჭდვა