#დავალება-1
itemprice = 250   #ნივთის ღირებულება
itemquantity = 20  #ნივთის რაოდენობა
print(itemprice * itemquantity)  #ყველა ნივთის შეძენისას საჭიროა 5000-ის გადახდა

#დავალება-2
myage = 13  #ჩემი ასაკი
broage = 17 #ძმის ასაკი
print(myage + 10)  #ჩემს ასაკს დამატებული 10
print(broage + 10) #ძმის ასაკს დამატებული 10

#დავალება-3 
quest1 = 350 #პირველი ცვლადის მნიშვნელობა
quest2 = 970  #მეორე ცვლადის მნიშვნელობა
print(quest1 + quest2)  #ცვლადების შეკრება
print(quest1 - quest2)  #ცვლადების გამოკლება
print(quest1 * quest2)  #ცვლადების გამრავლება
print(quest1 / quest2)  #ცვლადების გაყოფა

#დავალება-4
my_name = "giorgi" #ჩემი სახელი ცვლადში
my_age = 13        #ჩემი ასაკი ცვლადში
print(my_name)  #აქ დავბეჭდე ჩემი სახელი
print(my_age)  #აქ დავბეჭდე ჩემი ასაკი

#დავალება-5
my_age = 13 #ჩემი ასაკი
mydad_age = 47 #მშობლის ასაკი
print(my_age + 10) #ჩემი ასაკი ათი წლის შემდეგ-23
print(mydad_age - (my_age + 10)) #მშობლის ასაკი ჩემს ასაკზე 10 წლის შემდეგ იქნება 24-ით მეტი



