print(250+300) #რიცხვების შეკრება პრინტ ფუნქციით
print(800-120)  #რიცხვების გამოკლება
print(10*4)   #რიცხვების გამრავლება
print(30/3)  #რიცხვების გაყოფა

#ტერმინალის მნიშვნელობა: ტერმინალი არის ფანჯარა ვიზუალ სტუდიოში რომელიც გვეხმარება კოდის წერაში,რომ კოდის დაწერისას გამოისახოს ბრძანება, გვაჩვენოს ჩვენი შედეგი კოდის დაწერის შემდეგ

name1=30
name2=50               #აქ შევქმენი ცვლადი რომელსაც მივანიჭე რიცხვი და დაბეჭვდის საშუალებით შევკრიბე ისინი
print(name1 + name2)

first_name ="saxeli"
last_name  ="gvari"
full_name  = first_name +" "+ last_name  #აქ შევქმენი ცვლადი რის დახმარებითაც ტერმინალში გამოისახა ჩემი სახელი და გვარი
print("me mqvia "+full_name)

question1 = 150
question2 =250
print(question2 / question1)

#რა არის სტრინგი:როდესაც პრინტში ფრჩხილების შუაში მოვათავსებთ ბრჭყალებს, მაშინ შიგნით ჩაწერილი ტექსტი ან რიცხვი აისახება ტერმინალში როგორც ჩაიწერება, ანუ ამას ეწოდება სტრინგი
#და მთელი რიცხვი კი, ბრჭყალების გარეშე, სადაც შეგვიძლია შევასრულოთ მოქმედებები ან გადავაბათ ერთმანეთს სიტყვები.ამიტომ მთელ რიცხვში რომ ჩავწეროთ სიტყვა ის უბრალოდ არ იმუშავებს